In [103]:
import os
import pandas as pd
from pathlib import Path

In [104]:
xml_file = Path(".") / "my.xlsx"
xml_file

WindowsPath('my.xlsx')

In [34]:
path = os.getcwd()
path

'C:\\Users\\ayrat'

In [125]:
files = os.listdir('C:/Users/ayrat/OneDrive/Рабочий стол/Excel')
files

['1.xlsx', '2.xlsx']

In [143]:
files_xls = [f for f in files if f[-4:] == 'xlsx']
files_xls

['1.xlsx', '2.xlsx']

In [156]:
files_xls = ['C:/Users/ayrat/OneDrive/Рабочий стол/Excel/'+f for f in files if f[-4:] == 'xlsx']
files_xls

['C:/Users/ayrat/OneDrive/Рабочий стол/Excel/1.xlsx',
 'C:/Users/ayrat/OneDrive/Рабочий стол/Excel/2.xlsx']

In [101]:
df = pd.DataFrame()

In [89]:
x = 0
for f in files_xls:
    data = pd.read_excel(f, 'Лист1')
    data['имя файла'] = files_xls[x].split('/')[len(files_xls[0].split('/'))-1]
    x += 1
    df = df.append(data)

In [107]:
files_xls[0].split('/')

['C:', 'Users', 'ayrat', 'OneDrive', 'Рабочий стол', 'Excel', '1.xlsx']

In [90]:
df

  Unnamed: 0 Unnamed: 1 Unnamed: 2 имя файла
0        NaN        NaN        NaN    1.xlsx
1          1          2          3    1.xlsx
2      арбуз      тыква   апельсин    1.xlsx
0        NaN        NaN        NaN    2.xlsx
1          1          2          3    2.xlsx
2   мандарин      слива       дыня    2.xlsx

In [98]:
for f in files_xls:
    data = pd.read_excel('C:/Users/ayrat/OneDrive/Рабочий стол/Excel/'+f, 'Лист1')
    data['имя файла'] = f
    df = df.append(data)

In [99]:
df

  Unnamed: 0 Unnamed: 1 Unnamed: 2 имя файла
0        NaN        NaN        NaN    1.xlsx
1          1          2          3    1.xlsx
2      арбуз      тыква   апельсин    1.xlsx
0        NaN        NaN        NaN    2.xlsx
1          1          2          3    2.xlsx
2   мандарин      слива       дыня    2.xlsx

In [114]:
for f in files_xls:
    with open('C:/Users/ayrat/OneDrive/Рабочий стол/Excel/'+f, 'r') as file:
        file
    #data = pd.read_excel(f, 'Лист1')
    #data['имя файла'] = f
    #df = df.append(file)

OSError: [Errno 22] Invalid argument: 'C:/Users/ayrat/OneDrive/Рабочий стол/Excel/C:/Users/ayrat/OneDrive/Рабочий стол/Excel/1.xlsx'

In [174]:
with open('C:/Users/ayrat/OneDrive/Рабочий стол/registrations_.txt','r', encoding="utf-8") as file:
    print(file.read()[0:100])

Ольга rin@mail.ru 45
Артём knkjmbwwe@gmail.com 40
Нагиев kptvmbjlrs@gmail.com 81
Пенг zrlddzogc@mail

In [153]:
file = open(files_xls[0], 'wb')
file.close()

In [ ]:
from geopandas import GeoDataFrame
df = GeoDataFrame.from_file("CARPARKS.mid")
df

In [28]:
df

  Unnamed: 0 Unnamed: 1 Unnamed: 2 имя файла
0        NaN        NaN        NaN    1.xlsx
1          1          2          3    1.xlsx
2      арбуз      тыква   апельсин    1.xlsx
0        NaN        NaN        NaN    2.xlsx
1          1          2          3    2.xlsx
2   мандарин      слива       дыня    2.xlsx

In [29]:
df.reset_index()

   index Unnamed: 0 Unnamed: 1 Unnamed: 2 имя файла
0      0        NaN        NaN        NaN    1.xlsx
1      1          1          2          3    1.xlsx
2      2      арбуз      тыква   апельсин    1.xlsx
3      0        NaN        NaN        NaN    2.xlsx
4      1          1          2          3    2.xlsx
5      2   мандарин      слива       дыня    2.xlsx

In [30]:
df.reset_index(drop = True)

  Unnamed: 0 Unnamed: 1 Unnamed: 2 имя файла
0        NaN        NaN        NaN    1.xlsx
1          1          2          3    1.xlsx
2      арбуз      тыква   апельсин    1.xlsx
3        NaN        NaN        NaN    2.xlsx
4          1          2          3    2.xlsx
5   мандарин      слива       дыня    2.xlsx

In [31]:
%%timeit 
df.loc[df['Unnamed: 0'] == 1, 'text_rating'] = 'Pass'

503 µs ± 27.7 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [32]:
df

  Unnamed: 0 Unnamed: 1 Unnamed: 2 имя файла text_rating
0        NaN        NaN        NaN    1.xlsx         NaN
1          1          2          3    1.xlsx        Pass
2      арбуз      тыква   апельсин    1.xlsx         NaN
0        NaN        NaN        NaN    2.xlsx         NaN
1          1          2          3    2.xlsx        Pass
2   мандарин      слива       дыня    2.xlsx         NaN

In [ ]:
df = pd.DataFrame([('bird', 389.0),
                   ('bird', 24.0),
                   ('mammal', 80.5),
                   ('mammal', np.nan)],
                  index=['falcon', 'parrot', 'lion', 'monkey'],
                  columns=('class', 'max_speed'))

In [ ]:
.loc — используется для доступа по строковой метке — т.е. фактически по значению индекса и по названию столбца
.iloc — используется для доступа по числовому значению (начиная от 0) — т.е. по номеру строки и номеру столбца

In [36]:
df.loc[1,'Unnamed: 0']

1    1
1    1
Name: Unnamed: 0, dtype: object

In [38]:
df.iloc[1,2]

3

In [44]:
df.index.drop

In [45]:
df

  Unnamed: 0 Unnamed: 1 Unnamed: 2 имя файла text_rating
0        NaN        NaN        NaN    1.xlsx         NaN
1          1          2          3    1.xlsx        Pass
2      арбуз      тыква   апельсин    1.xlsx         NaN
0        NaN        NaN        NaN    2.xlsx         NaN
1          1          2          3    2.xlsx        Pass
2   мандарин      слива       дыня    2.xlsx         NaN

In [46]:
#скрыть индекс из фрейма данных
df.style.hide_index()

In [52]:
#экспорт в эксел без инжекса
df.to_excel("df.xlsx", sheet_name='Probability', startrow=3, startcol=0, index=False)